[notebook](http://localhost:8888/notebooks/scripts/31.ipynb)

In [49]:
import pandas as pd
from IPython.display import display
pd.set_option('display.max_rows', 10)

In [50]:
drinks = pd.read_csv('../data/drinks.csv')

In [51]:
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

In [52]:
# get_option: 
pd.get_option('display.max_rows')

10

In [53]:
# set_option None: print all
pd.set_option('display.max_rows', None)
pd.get_option('display.max_rows')

In [54]:
# reset_option
pd.reset_option('display.max_rows')
pd.get_option('display.max_rows')

60

In [55]:
# max_columns
pd.get_option('display.max_columns')

20

In [56]:
train = pd.read_csv('../data/titanic_train.csv')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,NaN,S

In [57]:
# max_colwidth
pd.get_option('display.max_colwidth')

1000

In [58]:
# set_option max_colwidth
pd.set_option('display.max_colwidth', 1000)
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,NaN,S

In [59]:
# display.precision
pd.set_option('display.precision', 2)
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,NaN,S

In [60]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [61]:
# 3 float64
drinks['x'] = drinks.wine_servings.astype("float64") * 1000
drinks['y'] = drinks.total_litres_of_pure_alcohol * 1000
drinks['wine_servingsAll'] = drinks.wine_servings.astype('float64')*1000
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,x,y,wine_servingsAll
0,Afghanistan,0,0,0,0.0,Asia,0.0,0.0,0.0
1,Albania,89,132,54,4.9,Europe,"54,000.0","4,900.0","54,000.0"
2,Algeria,25,0,14,0.7,Africa,"14,000.0",700.0,"14,000.0"
3,Andorra,245,138,312,12.4,Europe,"312,000.0","12,400.0","312,000.0"
4,Angola,217,57,45,5.9,Africa,"45,000.0","5,900.0","45,000.0"

In [62]:
# display.float_format {:,} : make floating point for float64 type
pd.set_option('display.float_format', '{:,}'.format)
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,x,y,wine_servingsAll
0,Afghanistan,0,0,0,0.0,Asia,0.0,0.0,0.0
1,Albania,89,132,54,4.9,Europe,"54,000.0","4,900.0","54,000.0"
2,Algeria,25,0,14,0.7,Africa,"14,000.0",700.0,"14,000.0"
3,Andorra,245,138,312,12.4,Europe,"312,000.0","12,400.0","312,000.0"
4,Angola,217,57,45,5.9,Africa,"45,000.0","5,900.0","45,000.0"

In [63]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
x                               float64
y                               float64
wine_servingsAll                float64
dtype: object

In [64]:
# view all options
# pd.describe_option()

In [65]:
# search for specific options by name
pd.describe_option('display.float_format')

display.float_format : callable
    The callable should accept a floating point number and return
    a string with the desired format of the number. This is used
    in some places like SeriesFormatter.
    See formats.format.EngFormatter for an example.
    [default: None] [currently: <built-in method format of str object at 0x10af0d990>]

In [66]:
# reset_option all: 
pd.reset_option('all')

height has been deprecated.

line_width has been deprecated, use display.width instead (currently both are
identical)

/Users/Natsume/miniconda2/envs/tryme/lib/python2.7/site-packages/ipykernel/__main__.py:2: FutureWarning:
mpl_style had been deprecated and will be removed in a future version.
Use `matplotlib.pyplot.style.use` instead.

  from ipykernel import kernelapp as app